Use ComputerCompanyDB;

Go
INSERT INTO Categories (CategoryName, Description) VALUES 
('Процессоры', 'Центральные и графические процессоры для компьютеров'),
('Оперативная память', 'Модули памяти для увеличения производительности'),
('Хранение данных', 'Накопители SSD, HDD и флеш-устройства'),
('Видеокарты', 'Графические адаптеры для рендеринга и игр'),
('Материнские платы', 'Платы для сборки и подключения компонентов ПК'),
('Блоки питания', 'Устройства для электропитания системных блоков'),
('Корпуса', 'Корпуса для сборки системных блоков'),
('Сетевые карты', 'Адаптеры для подключения к сети и интернету');

Go
-- Существующие
INSERT INTO Suppliers (SupplierName, ContactInfo, Address) VALUES 
('ПК Мастер', 'contact@pcmaster.by', 'Минск, улица Карла Маркса, 22'),
('КомплектТех', 'support@komplekt.by', 'Минск, улица Чкалова, 19'),
('ПроТех', 'sales@protech.by', 'Минск, улица Веры Хоружей, 28'),
('МегаКомплект', 'info@megacomplekt.by', 'Минск, улица Притыцкого, 45'),
('ТехноКомп', 'help@technocomp.by', 'Минск, улица Скрипникова, 37'),
('БелТехСнаб', 'bts@beltech.by', 'Минск, улица Богдановича, 95'),
('РесурсКомп', 'info@resurs.by', 'Минск, проспект Дзержинского, 100'),
('Компьютерный мир', 'sales@compworld.by', 'Минск, улица Тимирязева, 50'),
('ГлобалТех', 'support@globaltech.by', 'Минск, проспект Машерова, 77'),
('Сети и Комплектующие', 'net@komplekts.by', 'Минск, улица Уборевича, 33');

Go
-- Вставка данных в таблицу Components с учетом категорий
INSERT INTO Components (ComponentName, Price, WarrantyMonths, CategoryID) VALUES 
('Intel Core i5-12600K', 300.00, 1),
('AMD Ryzen 5 5600X', 280.00, 1),
('Corsair Vengeance 8GB DDR4', 50.00, 2),
('Kingston Fury Beast 16GB DDR5', 100.00,  2),
('Samsung 870 EVO 1TB SSD', 120.00, 3),
('Western Digital Black 2TB HDD', 130.00, 3),
('NVIDIA GeForce GTX 1660', 250.00, 4),
('AMD Radeon RX 6600', 300.00, 4),
('MSI B450 TOMAHAWK MAX', 140.00, 5),
('ASUS ROG STRIX B550-F', 180.00, 5),
('Corsair RM850x', 160.00, 6),
('be quiet! Pure Power 11', 110.00, 6),
('NZXT H7 Flow', 140.00, 7),
('Fractal Design Meshify C', 120.00, 7),
('TP-Link TX3000E Wi-Fi Adapter', 80.00, 8),
('ASUS PCE-AC68', 90.00, 8),
('Crucial P5 Plus 1TB SSD', 140.00, 3),
('AMD Ryzen 9 5900X', 450.00, 1),
('Corsair H100i Elite Capellix', 200.00, 6),
('Noctua NH-D15 Cooler', 100.00, 6),
('ASUS TUF Gaming X570-PLUS', 210.00, 5),
('Deepcool Matrexx 55 Case', 90.00, 7);

Go
INSERT INTO Purchases (SupplierID, PurchaseDate, PurchaseReason) VALUES 
(1, '2025-02-10', 'Закупка новых процессоров'),
(2, '2025-02-12', 'Обновление памяти'),
(3, '2025-02-15', 'Поставка накопителей'),
(4, '2025-02-18', 'Закупка видеокарт'),
(5, '2025-02-20', 'Обновление материнских плат'),
(6, '2025-02-22', 'Блоки питания для новых проектов'),
(7, '2025-02-25', 'Расширение ассортимента корпусов'),
(8, '2025-02-28', 'Сетевые устройства для клиентов'),
(3, '2025-03-01', 'Закупка оперативной памяти и процессоров'),
(7, '2025-03-03', 'Обновление ассортимента видеокарт'),
(5, '2025-03-04', 'Поставка новых корпусов для сборки ПК'),
(9, '2025-04-08', 'Закупка сетевых адаптеров и блоков питания');


Go
INSERT INTO PurchaseDetails (PurchaseID, ComponentID, Quantity) VALUES 
-- PurchaseID 1
(1, 1, 25),
(1, 2, 20),
(1, 3, 30),
(1, 4, 40),

-- PurchaseID 2
(2, 3, 50),
(2, 4, 35),
(2, 5, 40),
(2, 6, 25),

-- PurchaseID 3
(3, 5, 20),
(3, 6, 15),
(3, 7, 30),
(3, 8, 25),

-- PurchaseID 4
(4, 7, 20),
(4, 8, 30),
(4, 9, 25),
(4, 10, 15),

-- PurchaseID 5
(5, 9, 20),
(5, 10, 25),
(5, 11, 20),
(5, 12, 25),

-- PurchaseID 6
(6, 11, 20),
(6, 12, 30),
(6, 13, 40),
(6, 14, 20),

-- PurchaseID 7
(7, 13, 25),
(7, 14, 30),
(7, 15, 20),
(7, 16, 25),

-- PurchaseID 8
(8, 15, 20),
(8, 16, 25),
(8, 17, 30),
(8, 18, 40),

-- PurchaseID 9
(9, 3, 15),
(9, 4, 25),
(9, 5, 10),

-- PurchaseID 10
(10, 7, 12),
(10, 8, 18),
(10, 9, 20),
(10, 10, 15),
(10, 11, 8),

-- PurchaseID 11
(11, 13, 16),
(11, 15, 14),
(11, 16, 11),
(11, 18, 20),
(11, 19, 25),
(11, 20, 30),

-- PurchaseID 12
(12, 17, 25),
(12, 18, 18),
(12, 15, 12),
(12, 16, 20);

DELETE FROM PurchaseDetails
DBCC CHECKIDENT (PurchaseDetails, RESEED, 0);

SELECT dbo.GetComponentName(dbo.GetCheapestComponent()) as "Самый дешевый компонент"

SELECT dbo.GetLastPurchaseDate(3) as "Последняя дата приобретения для покупателя"


